burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_timer.h
/*!
    \file    GD32M53X_timer.h
    \brief   definitions for the TIMER

    \version 2026-03-04, V1.0.0, firmware for GD32M53x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32M53X_TIMER_H
#define GD32M53X_TIMER_H

#include "gd32m53x.h"

#define REGIDX_BIT(regidx, bitpos, value)   (((uint32_t)(regidx) << 24U) | (uint32_t)((bitpos) << 16U) | ((uint32_t)(value)))
#define REG_INDEX(val)                      (((uint32_t)(val) & 0xFF000000U) >> 24U)
#define REG_BIT_POS(val)                    (((uint32_t)(val) & 0x00FF0000U) >> 16U)
#define REG_BIT_NUM(val)                    ((uint32_t)(val) & 0x000000FFU)


/* TIMERx(x=0,1,2,7) definitions */
#define TIMER0                                             TIMER_BASE
#define TIMER1                                             (TIMER_BASE + 0x00001400U)
#define TIMER2                                             (TIMER_BASE + 0x00001800U)
#define TIMER7                                             (TIMER_BASE + 0x00000800U)

/* registers definitions */
#define TIMER_CTL0(timerx)                                 REG32((timerx) + 0x00U)           /*!< TIMER control register 0 */
#define TIMER_CTL1(timerx)                                 REG32((timerx) + 0x04U)           /*!< TIMER control register 1 */
#define TIMER_SMCFG(timerx)                                REG32((timerx) + 0x08U)           /*!< TIMER slave mode configuration register */
#define TIMER_DMAINTEN(timerx)                             REG32((timerx) + 0x0CU)           /*!< TIMER DMA and interrupt enable register */
#define TIMER_INTF(timerx)                                 REG32((timerx) + 0x10U)           /*!< TIMER interrupt flag register */
#define TIMER_SWEVG(timerx)                                REG32((timerx) + 0x14U)           /*!< TIMER software event generation register */
#define TIMER_CHCTL0(timerx)                               REG32((timerx) + 0x18U)           /*!< TIMER channel control register 0 */
#define TIMER_CHCTL1(timerx)                               REG32((timerx) + 0x1CU)           /*!< TIMER channel control register 1 */
#define TIMER_CHCTL2(timerx)                               REG32((timerx) + 0x20U)           /*!< TIMER channel control register 2 */
#define TIMER_CNT(timerx)                                  REG32((timerx) + 0x24U)           /*!< TIMER counter register */
#define TIMER_PSC(timerx)                                  REG32((timerx) + 0x28U)           /*!< TIMER prescaler register */
#define TIMER_CAR(timerx)                                  REG32((timerx) + 0x2CU)           /*!< TIMER counter auto reload register */
#define TIMER_CREP(timerx)                                 REG32((timerx) + 0x30U)           /*!< TIMER counter repetition register */
#define TIMER_CH0CV(timerx)                                REG32((timerx) + 0x34U)           /*!< TIMER channel 0 capture/compare value register */
#define TIMER_CH1CV(timerx)                                REG32((timerx) + 0x38U)           /*!< TIMER channel 1 capture/compare value register */
#define TIMER_CH2CV(timerx)                                REG32((timerx) + 0x3CU)           /*!< TIMER channel 2 capture/compare value register */
#define TIMER_CH3CV(timerx)                                REG32((timerx) + 0x40U)           /*!< TIMER channel 3 capture/compare value register */
#define TIMER_CCHP(timerx)                                 REG32((timerx) + 0x44U)           /*!< TIMER complementary channel protection register */
#define TIMER_MCHCTL0(timerx)                              REG32((timerx) + 0x48U)           /*!< TIMER multi mode channel control register 0 */
#define TIMER_MCHCTL1(timerx)                              REG32((timerx) + 0x4CU)           /*!< TIMER multi mode channel control register 1 */
#define TIMER_MCHCTL2(timerx)                              REG32((timerx) + 0x50U)           /*!< TIMER multi mode channel control register 2 */
#define TIMER_MCH0CV(timerx)                               REG32((timerx) + 0x54U)           /*!< TIMER multi mode channel 0 capture or compare value register */
#define TIMER_MCH1CV(timerx)                               REG32((timerx) + 0x58U)           /*!< TIMER multi mode channel 1 capture or compare value register */
#define TIMER_MCH2CV(timerx)                               REG32((timerx) + 0x5CU)           /*!< TIMER multi mode channel 2 capture or compare value register */
#define TIMER_MCH3CV(timerx)                               REG32((timerx) + 0x60U)           /*!< TIMER multi mode channel 3 capture or compare value register */
#define TIMER_CH0COMV_ADD(timerx)                          REG32((timerx) + 0x64U)           /*!< TIMER channel 0 additional compare value register */
#define TIMER_CH1COMV_ADD(timerx)                          REG32((timerx) + 0x68U)           /*!< TIMER channel 1 additional compare value register */
#define TIMER_CH2COMV_ADD(timerx)                          REG32((timerx) + 0x6CU)           /*!< TIMER channel 2 additional compare value register */
#define TIMER_CH3COMV_ADD(timerx)                          REG32((timerx) + 0x70U)           /*!< TIMER channel 3 additional compare value register */
#define TIMER_CTL2(timerx)                                 REG32((timerx) + 0x74U)           /*!< TIMER control register 2 */
#define TIMER_AFCTL(timerx)                                REG32((timerx) + 0x8CU)           /*!< TIMER alternate function control register */
#define TIMER_IREP(timerx)                                 REG32((timerx) + 0x90U)           /*!< TIMER Interrupt Counter reption register  */
#define TIMER_ADCRCTL(timerx)                              REG32((timerx) + 0x94U)           /*!< TIMER A/D conversion start request control register */
#define TIMER_ADCCR1(timerx)                               REG32((timerx) + 0x98U)           /*!< TIMER ADC trigger compare value register1*/
#define TIMER_ADCCR2(timerx)                               REG32((timerx) + 0x9CU)           /*!< TIMER ADC trigger compare value register2*/
#define TIMER_ADCREP(timerx)                               REG32((timerx) + 0xA0U)           /*!< TIMER ADC counter repetition register */
#define TIMER_ADCTL(timerx)                                REG32((timerx) + 0xACU)           /*!< TIMER ADC contrlol register */
#define TIMER_SHUPM0(timerx)                               REG32((timerx) + 0xC4U)           /*!< TIMER shadow reg update register */
#define TIMER_SHUPM1(timerx)                               REG32((timerx) + 0xC8U)           /*!< TIMER shadow reg update register */
#define TIMER_COUMSEL(timerx)                              REG32((timerx) + 0xCCU)           /*!< TIMER counter overflow or underflow mode selection */
#define TIMER_DMACFG(timerx)                               REG32((timerx) + 0xE0U)           /*!< TIMER DMA configuration register */
#define TIMER_DMATB(timerx)                                REG32((timerx) + 0xE4U)           /*!< TIMER DMA transfer buffer register */
#define TIMER_CFG(timerx)                                  REG32((timerx) + 0xFCU)           /*!< TIMER configuration register */

