burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_timer.h
/* TIMER_CNT */
#define TIMER_CNT_CNT                                      BITS(0,15)                        /*!< 16 bit timer counter */
#define TIMER_CNT_UPIFBU                                   BIT(31)                           /*!< UPIF bit back up */

/* TIMER_PSC */
#define TIMER_PSC_PSC                                      BITS(0,15)                        /*!< prescaler value of the counter clock */

/* TIMER_CAR */
#define TIMER_CAR_CARL                                     BITS(0,15)                        /*!< 16 bit counter auto reload value */

/* TIMER_CREP */
#define TIMER_CREP_CREP                                    BITS(0,7)                         /*!< counter repetition value */

/* TIMER_CH0CV */
#define TIMER_CH0CV_CH0VAL                                 BITS(0,15)                        /*!< 16 bit capture/compare value of channel 0 */

/* TIMER_CH1CV */
#define TIMER_CH1CV_CH1VAL                                 BITS(0,15)                        /*!< 16 bit capture/compare value of channel 1 */

/* TIMER_CH2CV */
#define TIMER_CH2CV_CH2VAL                                 BITS(0,15)                        /*!< 16 bit capture/compare value of channel 2 */

/* TIMER_CH3CV */
#define TIMER_CH3CV_CH3VAL                                 BITS(0,15)                        /*!< 16 bit capture/compare value of channel 3 */

/* TIMER_CCHP */
#define TIMER_CCHP_DTCFG                                   BITS(0,7)                         /*!< dead time configure */
#define TIMER_CCHP_PROT                                    BITS(8,9)                         /*!< complementary register protect control */
#define TIMER_CCHP_IOS                                     BIT(10)                           /*!< idle mode off-state configure */
#define TIMER_CCHP_ROS                                     BIT(11)                           /*!< run mode off-state configure */
#define TIMER_CCHP_BRKEN                                   BIT(12)                           /*!< break enable */
#define TIMER_CCHP_BRKP                                    BIT(13)                           /*!< break polarity */
#define TIMER_CCHP_OAEN                                    BIT(14)                           /*!< output automatic enable */
#define TIMER_CCHP_POEN                                    BIT(15)                           /*!< primary output enable */
#define TIMER_CCHP_BRKF                                    BITS(16,19)                       /*!< break signal filter */

/* TIMER_MCHCTL0 */
/* output compare mode */
#define TIMER_MCHCTL0_MCH0MS                               (BITS(0,1) | BIT(30))             /*!< multi mode channel 0 mode selection */
#define TIMER_MCHCTL0_MCH0COMFEN                           BIT(2)                            /*!< multi mode channel 0 output compare fast enable */
#define TIMER_MCHCTL0_MCH0COMSEN                           BIT(3)                            /*!< multi mode channel 0 output compare shadow enable */
#define TIMER_MCHCTL0_MCH0COMCTL                           BITS(4,6)                         /*!< multi mode channel 0 output compare control  */
#define TIMER_MCHCTL0_MCH0COMCEN                           BIT(7)                            /*!< multi mode channel 0 output compare clear enable */
#define TIMER_MCHCTL0_MCH1MS                               (BITS(8,9) | BIT(31))             /*!< multi mode channel 1 mode selection */
#define TIMER_MCHCTL0_MCH1COMFEN                           BIT(10)                           /*!< multi mode channel 1 output compare fast enable */
#define TIMER_MCHCTL0_MCH1COMSEN                           BIT(11)                           /*!< multi mode channel 1 output compare shadow enable */
#define TIMER_MCHCTL0_MCH1COMCTL                           BITS(12,14)                       /*!< multi mode channel 1 output compare control  */
#define TIMER_MCHCTL0_MCH1COMCEN                           BIT(15)                           /*!< multi mode channel 1 output compare clear enable */
/* input capture mode */
#define TIMER_MCHCTL0_MCH0CAPPSC                           BITS(2,3)                         /*!< multi mode channel 0 input capture prescaler */
#define TIMER_MCHCTL0_MCH0CAPFLT                           BITS(4,7)                         /*!< multi mode channel 0 input capture filter control */
#define TIMER_MCHCTL0_MCH1CAPPSC                           BITS(10,11)                       /*!< multi mode channel 1 input capture prescaler */
#define TIMER_MCHCTL0_MCH1CAPFLT                           BITS(12,15)                       /*!< multi mode channel 1 input capture filter control */

/* TIMER_MCHCTL1 */
/* output compare mode */
#define TIMER_MCHCTL1_MCH2MS                               (BITS(0,1) | BIT(30))             /*!< multi mode channel 2 mode selection */
#define TIMER_MCHCTL1_MCH2COMFEN                           BIT(2)                            /*!< multi mode channel 2 output compare fast enable */
#define TIMER_MCHCTL1_MCH2COMSEN                           BIT(3)                            /*!< multi mode channel 2 output compare shadow enable */
#define TIMER_MCHCTL1_MCH2COMCTL                           BITS(4,6)                         /*!< multi mode channel 2 output compare control  */
#define TIMER_MCHCTL1_MCH2COMCEN                           BIT(7)                            /*!< multi mode channel 2 output compare clear enable */
#define TIMER_MCHCTL1_MCH3MS                               (BITS(8,9) | BIT(31))             /*!< multi mode channel 3 mode selection */
#define TIMER_MCHCTL1_MCH3COMFEN                           BIT(10)                           /*!< multi mode channel 3 output compare fast enable */
#define TIMER_MCHCTL1_MCH3COMSEN                           BIT(11)                           /*!< multi mode channel 3 output compare shadow enable */
#define TIMER_MCHCTL1_MCH3COMCTL                           BITS(12,14)                       /*!< multi mode channel 3 output compare control  */
#define TIMER_MCHCTL1_MCH3COMCEN                           BIT(15)                           /*!< multi mode channel 3 output compare clear enable */
/* input capture mode */
#define TIMER_MCHCTL1_MCH2CAPPSC                           BITS(2,3)                         /*!< multi mode channel 2 input capture prescaler */
#define TIMER_MCHCTL1_MCH2CAPFLT                           BITS(4,7)                         /*!< multi mode channel 2 input capture filter control */
#define TIMER_MCHCTL1_MCH3CAPPSC                           BITS(10,11)                       /*!< multi mode channel 3 input capture prescaler */
#define TIMER_MCHCTL1_MCH3CAPFLT                           BITS(12,15)                       /*!< multi mode channel 3 input capture filter control */

/* TIMER_MCHCTL2 */
#define TIMER_MCHCTL2_MCH0FP                               BITS(0,1)                         /*!< multi mode channel 0 capture or compare function polarity */
#define TIMER_MCHCTL2_MCH1FP                               BITS(2,3)                         /*!< multi mode channel 1 capture or compare function polarity */
#define TIMER_MCHCTL2_MCH2FP                               BITS(4,5)                         /*!< multi mode channel 2 capture or compare function polarity */
#define TIMER_MCHCTL2_MCH3FP                               BITS(6,7)                         /*!< multi mode channel 3 capture or compare function polarity */

/* TIMER_MCH0CV */
#define TIMER_MCH0CV_MCH0VAL                               BITS(0,15)                        /*!< 16 bit capture or compare value of multi mode channel 0 */

