burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_timer.h
/* TIMER_MCH1CV */
#define TIMER_MCH1CV_MCH1VAL                               BITS(0,15)                        /*!< 16 bit capture or compare value of multi mode channel 1 */

/* TIMER_MCH2CV */
#define TIMER_MCH2CV_MCH2VAL                               BITS(0,15)                        /*!< 16 bit capture or compare value of multi mode channel 2 */

/* TIMER_MCH3CV */
#define TIMER_MCH3CV_MCH3VAL                               BITS(0,15)                        /*!< 16 bit capture or compare value of multi mode channel 3 */

/* TIMER_CH0COMV_ADD */
#define TIMER_CH0COMV_ADD_CH0COMVAL_ADD                    BITS(0,15)                        /*!< additional compare value of channel 0 */

/* TIMER_CH1COMV_ADD */
#define TIMER_CH1COMV_ADD_CH1COMVAL_ADD                    BITS(0,15)                        /*!< additional compare value of channel 1 */

/* TIMER_CH2COMV_ADD */
#define TIMER_CH2COMV_ADD_CH2COMVAL_ADD                    BITS(0,15)                        /*!< additional compare value of channel 2 */

/* TIMER_CH3COMV_ADD */
#define TIMER_CH3COMV_ADD_CH3COMVAL_ADD                    BITS(0,15)                        /*!< additional compare value of channel 3 */

/*TIMER_CTL2*/
#define TIMER_CTL2_CH0OMPSEL                               BITS(8,9)                         /*!< channel 0 output march pulse select */
#define TIMER_CTL2_CH1OMPSEL                               BITS(10,11)                       /*!< channel 1 output march pulse select */
#define TIMER_CTL2_CH2OMPSEL                               BITS(12,13)                       /*!< channel 2 output march pulse select */
#define TIMER_CTL2_CH3OMPSEL                               BITS(14,15)                       /*!< channel 3 output march pulse select */
#define TIMER_CTL2_MCH0MSEL                                BITS(20,21)                       /*!< multi mode channel 0 mode select */
#define TIMER_CTL2_MCH1MSEL                                BITS(22,23)                       /*!< multi mode channel 1 mode select */
#define TIMER_CTL2_MCH2MSEL                                BITS(24,25)                       /*!< multi mode channel 2 mode select */
#define TIMER_CTL2_MCH3MSEL                                BITS(26,27)                       /*!< multi mode channel 3 mode select */

/* TIMER_AFCTL*/
#define TIMER_AFCTL_BRKIN0EN                               BIT(0)                            /*!< BREAK PIN  input enable */
#define TIMER_AFCTL_BRKCMP0EN                              BIT(1)                            /*!< BREAK CMP0 input enbale */
#define TIMER_AFCTL_BRKCMP1EN                              BIT(2)                            /*!< BREAK CMP1 input enbale */
#define TIMER_AFCTL_BRKCMP2EN                              BIT(3)                            /*!< BREAK CMP2 input enbale */
#define TIMER_AFCTL_BRKCMP3EN                              BIT(4)                            /*!< BREAK CMP3 input enbale */
#define TIMER_AFCTL_BRKIN0P                                BIT(8)                            /*!< BREAK PIN  input polarity */
#define TIMER_AFCTL_BRKCMP0P                               BIT(9)                            /*!< BREAK CMP0 input polarity */
#define TIMER_AFCTL_BRKCMP1P                               BIT(10)                           /*!< BREAK CMP1 input polarity */
#define TIMER_AFCTL_BRKCMP2P                               BIT(11)                           /*!< BREAK CMP2 input polarity */
#define TIMER_AFCTL_BRKCMP3P                               BIT(12)                           /*!< BREAK CMP3 input polarity */
#define TIMER_AFCTL_OCRINSEL                               BITS(16,18)                       /*!< ocref clr input source selection */

/* TIMER_IREP*/
#define TIMER_IREP_IREP                                    BIT(0,7)                          /*!< interrupt reption value */

/* TIMER_ADCRCTL*/
#define TIMER_ADCRCTL_ADT2DWGTEN                           BIT(4)                            /*!< the CNT down-count TIMERx_TRGB enable */
#define TIMER_ADCRCTL_ADT2UPGTEN                           BIT(5)                            /*!< the CNT up-count TIMERx_TRGB enable */
#define TIMER_ADCRCTL_ADT1DWGTEN                           BIT(6)                            /*!< the CNT down-count TIMERx_TRGA enable */
#define TIMER_ADCRCTL_ADT1UPGTEN                           BIT(7)                            /*!< the CNT up-count TIMERx_TRGA enable */

/*TIMER_ADCCR1*/
#define TIMER_ADCCR1_ADTCV1                                BITS(0,15)                        /*!< ADC event compare1 value */

/*TIMER_ADCCR2*/
#define TIMER_ADCCR2_ADTCV2                                BITS(0,15)                        /*!< ADC event compare2 value */

/*TIMER_ADCREP*/
#define TIMER_ADCREP_ADCREPA                               BITS(0,3)                         /*!< ADC TIMERx_TRGA repeat count setting */
#define TIMER_ADCREP_ADCREPB                               BITS(4,7)                         /*!< ADC TIMERx_TRGB repeat count setting */
#define TIMER_ADCREP_ADCREPAB                              BITS(8,11)                        /*!< ADC TIMERx_TRGAB repeat count setting */

/*TIMER_ADCTL*/
#define TIMER_ADCTL_ADCREPAMD                              BIT(0)                            /*!< ADC TIMERx_TRGA repeat counter decrement mode setting */
#define TIMER_ADCTL_ADCREPBMD                              BIT(1)                            /*!< ADC TIMERx_TRGB repeat counter decrement mode setting */
#define TIMER_ADCTL_ADTSUF                                 BIT(6)                            /*!< ADC trigger signal TIMERx_TRGUF enable when TIMERx_CNT underflow */
#define TIMER_ADCTL_ADTSOF                                 BIT(7)                            /*!< ADC trigger signal TIMERx_TRGOF enable when TIMERx_CNT overflow */
#define TIMER_ADCTL_ADTPREEN1                              BIT(8)                            /*!< ADTCV1[15:0] preload enable */
#define TIMER_ADCTL_ADTPREEN2                              BIT(9)                            /*!< ADTCV2[15:0] preload enable */
#define TIMER_ADCTL_ADREPRLD                               BIT(15)                           /*!< ADC repeat count reload immediately */

/*TIMER_SHUPM0*/
#define TIMER_SHUPM0_CH0CVUPSEL                            BITS(0,2)                         /*!< Channel 0 capture/compare value update mode selection */
#define TIMER_SHUPM0_CH0COMV_ADDUPSEL                      BITS(3,5)                         /*!< Channel 0 additional comparison value update mode selection */
#define TIMER_SHUPM0_CH1CVUPSEL                            BITS(6,8)                         /*!< Channel 1 capture/compare value update mode selection */
#define TIMER_SHUPM0_CH1COMV_ADDUPSEL                      BITS(9,11)                        /*!< Channel 1 additional comparison value update mode selection */
#define TIMER_SHUPM0_CH2CVUPSEL                            BITS(12,14)                       /*!< Channel 2 capture/compare value update mode selection */
#define TIMER_SHUPM0_CH2COMV_ADDUPSEL                      BITS(16,18)                       /*!< Channel 2 additional comparison value update mode selection */
#define TIMER_SHUPM0_CH3CVUPSEL                            BITS(19,21)                       /*!< Channel 3 capture/compare value update mode selection */
#define TIMER_SHUPM0_CH3COMV_ADDUPSEL                      BITS(22,24)                       /*!< Channel 3 additional comparison value update mode selection */
#define TIMER_SHUPM0_ADCCR1UPSEL                           BITS(26,27)                       /*!< ADC triggered comparison value 1 update mode selection */
#define TIMER_SHUPM0_ADCCR2UPSEL                           BITS(28,29)                       /*!< ADC triggered comparison value 2 update mode selection */
#define TIMER_SHUPM0_CARUPSEL                              BITS(30,31)                       /*!< the counter auto reload value update mode selection */

