burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_timer.h
/*TIMER_SHUPM1*/
#define TIMER_SHUPM1_MCH0CVUPSEL                           BITS(0,1)                         /*!< multi mode channel 0 capture/compare value update mode selection */
#define TIMER_SHUPM1_MCH1CVUPSEL                           BITS(2,3)                         /*!< multi mode channel 1 capture/compare value update mode selection */
#define TIMER_SHUPM1_MCH2CVUPSEL                           BITS(4,5)                         /*!< multi mode channel 2 capture/compare value update mode selection */
#define TIMER_SHUPM1_MCH3CVUPSEL                           BITS(6,7)                         /*!< multi mode channel 3 capture/compare value update mode selection */

/* TIMER_COUMSEL */
#define TIMER_COUMSEL_BRKAUMS                              BITS(2,3)                         /*!< break automatic output function mode selection */

/* TIMER_DMACFG */
#define TIMER_DMACFG_DMATA                                 BITS(0,5)                         /*!< DMA transfer access start address */
#define TIMER_DMACFG_DMATC                                 BITS(8,13)                        /*!< DMA transfer count */

/* TIMER_DMATB */
#define TIMER_DMATB_DMATB                                  BITS(0,31)                        /*!< DMA transfer buffer address */

/* TIMER_CFG */
#define TIMER_CFG_OUTSEL                                   BIT(0)                            /*!< the output value selection */
#define TIMER_CFG_CHVSEL                                   BIT(1)                            /*!< write CHxVAL register selection */

/* constants definitions */
/* TIMER init parameter struct definitions */
typedef struct {
    uint16_t prescaler;                                                                      /*!< prescaler value */
    uint16_t alignedmode;                                                                    /*!< aligned mode */
    uint16_t counterdirection;                                                               /*!< counter direction */
    uint32_t period;                                                                         /*!< period value */
    uint16_t clockdivision;                                                                  /*!< clock division value */
    uint8_t  repetitioncounter;                                                              /*!< the counter repetition value */
} timer_parameter_struct;

/* break parameter struct definitions */
typedef struct {
    uint16_t runoffstate;                                                                    /*!< run mode off-state */
    uint16_t ideloffstate;                                                                   /*!< idle mode off-state */
    uint16_t deadtime;                                                                       /*!< dead time */
    uint16_t breakpolarity;                                                                  /*!< break polarity */
    uint16_t outputautostate;                                                                /*!< output automatic enable */
    uint16_t protectmode;                                                                    /*!< complementary register protect control */
    uint16_t breakstate;                                                                     /*!< break enable */
    uint16_t breakfilter;                                                                    /*!< break filter */
} timer_break_parameter_struct;

/* channel output parameter struct definitions */
typedef struct {
    uint16_t outputstate;                                                                    /*!< channel output state */
    uint16_t outputnstate;                                                                   /*!< channel complementary output state */
    uint16_t ocpolarity;                                                                     /*!< channel output polarity */
    uint16_t ocnpolarity;                                                                    /*!< channel complementary output polarity */
    uint16_t ocidlestate;                                                                    /*!< idle state of channel output */
    uint16_t ocnidlestate;                                                                   /*!< idle state of channel complementary output */
} timer_oc_parameter_struct;

/* multi mode channel output parameter struct definitions */
typedef struct {
    uint16_t outputmode;                                                                     /*!< multi mode channel output mode selection */
    uint16_t outputstate;                                                                    /*!< multi mode channel output state */
    uint16_t ocpolarity;                                                                     /*!< multi mode channel output polarity */
} timer_omc_parameter_struct;

/* channel input parameter struct definitions */
typedef struct {
    uint16_t icpolarity;                                                                     /*!< channel input polarity */
    uint16_t icselection;                                                                    /*!< channel input mode selection */
    uint16_t icprescaler;                                                                    /*!< channel input capture prescaler */
    uint16_t icfilter;                                                                       /*!< channel input capture filter control */
} timer_ic_parameter_struct;

/* TIMER interrupt enable or disable */
#define TIMER_INT_UP                                       TIMER_DMAINTEN_UPIE               /*!< update interrupt */
#define TIMER_INT_CH0                                      TIMER_DMAINTEN_CH0IE              /*!< channel 0 capture or compare interrupt */
#define TIMER_INT_CH1                                      TIMER_DMAINTEN_CH1IE              /*!< channel 1 capture or compare interrupt */
#define TIMER_INT_CH2                                      TIMER_DMAINTEN_CH2IE              /*!< channel 2 capture or compare interrupt */
#define TIMER_INT_CH3                                      TIMER_DMAINTEN_CH3IE              /*!< channel 3 capture or compare interrupt */
#define TIMER_INT_CMT                                      TIMER_DMAINTEN_CMTIE              /*!< channel commutation interrupt flag */
#define TIMER_INT_TRG                                      TIMER_DMAINTEN_TRGIE              /*!< trigger interrupt */
#define TIMER_INT_BRK                                      TIMER_DMAINTEN_BRKIE              /*!< break interrupt */
#define TIMER_INT_FLOW                                     TIMER_DMAINTEN_FLOWIE             /*!< flow interrupt */
#define TIMER_INT_MCH0                                     TIMER_DMAINTEN_MCH0IE             /*!< multi mode channel 0 capture or compare interrupt */
#define TIMER_INT_MCH1                                     TIMER_DMAINTEN_MCH1IE             /*!< multi mode channel 1 capture or compare interrupt */
#define TIMER_INT_MCH2                                     TIMER_DMAINTEN_MCH2IE             /*!< multi mode channel 2 capture or compare interrupt */
#define TIMER_INT_MCH3                                     TIMER_DMAINTEN_MCH3IE             /*!< multi mode channel 3 capture or compare interrupt */
#define TIMER_INT_CH0COMADD                                TIMER_DMAINTEN_CH0COMADDIE        /*!< channel 0 additional compare interrupt */
#define TIMER_INT_CH1COMADD                                TIMER_DMAINTEN_CH1COMADDIE        /*!< channel 1 additional compare interrupt */
#define TIMER_INT_CH2COMADD                                TIMER_DMAINTEN_CH2COMADDIE        /*!< channel 2 additional compare interrupt */
#define TIMER_INT_CH3COMADD                                TIMER_DMAINTEN_CH3COMADDIE        /*!< channel 3 additional compare interrupt */

/* TIMER interrupt flag */
#define TIMER_INT_FLAG_UP                                  TIMER_INTF_UPIF                   /*!< update interrupt flag */
#define TIMER_INT_FLAG_CH0                                 TIMER_INTF_CH0IF                  /*!< channel 0 interrupt flag */
#define TIMER_INT_FLAG_CH1                                 TIMER_INTF_CH1IF                  /*!< channel 1 interrupt flag */
#define TIMER_INT_FLAG_CH2                                 TIMER_INTF_CH2IF                  /*!< channel 2 interrupt flag */
#define TIMER_INT_FLAG_CH3                                 TIMER_INTF_CH3IF                  /*!< channel 3 interrupt flag */
#define TIMER_INT_FLAG_CMT                                 TIMER_INTF_CMTIF                  /*!< channel commutation interrupt flag */
#define TIMER_INT_FLAG_TRG                                 TIMER_INTF_TRGIF                  /*!< trigger interrupt flag */
#define TIMER_INT_FLAG_BRK                                 TIMER_INTF_BRKIF                  /*!< break interrupt flag */
#define TIMER_INT_FLAG_SYSB                                TIMER_INTF_SYSBIF                 /*!< system source break interrupt flag */
#define TIMER_INT_FLAG_UNDERFLOW                           TIMER_INTF_UNDERFLOWIF            /*!< TIMER counter underflow interrupt flag */
#define TIMER_INT_FLAG_OVERFLOW                            TIMER_INTF_OVERFLOWIF             /*!< TIMER counter overflow interrupt flag */
#define TIMER_INT_FLAG_MCH0                                TIMER_INTF_MCH0IF                 /*!< multi mode channel 0 capture or compare interrupt flag */
#define TIMER_INT_FLAG_MCH1                                TIMER_INTF_MCH1IF                 /*!< multi mode channel 1 capture or compare interrupt flag */
#define TIMER_INT_FLAG_MCH2                                TIMER_INTF_MCH2IF                 /*!< multi mode channel 2 capture or compare interrupt flag */
#define TIMER_INT_FLAG_MCH3                                TIMER_INTF_MCH3IF                 /*!< multi mode channel 3 capture or compare interrupt flag */
#define TIMER_INT_FLAG_CH0COMADD                           TIMER_INTF_CH0COMADDIF            /*!< channel 0 additional compare interrupt flag */
#define TIMER_INT_FLAG_CH1COMADD                           TIMER_INTF_CH1COMADDIF            /*!< channel 1 additional compare interrupt flag */
#define TIMER_INT_FLAG_CH2COMADD                           TIMER_INTF_CH2COMADDIF            /*!< channel 2 additional compare interrupt flag */
#define TIMER_INT_FLAG_CH3COMADD                           TIMER_INTF_CH3COMADDIF            /*!< channel 3 additional compare interrupt flag */

/* TIMER flag */
#define TIMER_FLAG_UP                                      TIMER_INTF_UPIF                   /*!< update flag */
#define TIMER_FLAG_CH0                                     TIMER_INTF_CH0IF                  /*!< channel 0 capture or compare flag */
#define TIMER_FLAG_CH1                                     TIMER_INTF_CH1IF                  /*!< channel 1 capture or compare flag */
#define TIMER_FLAG_CH2                                     TIMER_INTF_CH2IF                  /*!< channel 2 capture or compare flag */
#define TIMER_FLAG_CH3                                     TIMER_INTF_CH3IF                  /*!< channel 3 capture or compare flag */
#define TIMER_FLAG_CMT                                     TIMER_INTF_CMTIF                  /*!< channel commutation flag */
#define TIMER_FLAG_TRG                                     TIMER_INTF_TRGIF                  /*!< trigger flag */
#define TIMER_FLAG_BRK                                     TIMER_INTF_BRKIF                  /*!< break flag */
#define TIMER_FLAG_CH0O                                    TIMER_INTF_CH0OF                  /*!< channel 0 overcapture flag */
#define TIMER_FLAG_CH1O                                    TIMER_INTF_CH1OF                  /*!< channel 1 overcapture flag */
#define TIMER_FLAG_CH2O                                    TIMER_INTF_CH2OF                  /*!< channel 2 overcapture flag */
#define TIMER_FLAG_CH3O                                    TIMER_INTF_CH3OF                  /*!< channel 3 overcapture flag */
#define TIMER_FLAG_SYSB                                    TIMER_INTF_SYSBIF                 /*!< system error flag */
#define TIMER_FLAG_UNDERFLOW                               TIMER_INTF_UNDERFLOWIF            /*!< TIMER counter underflow interrupt flag */
#define TIMER_FLAG_OVERFLOW                                TIMER_INTF_OVERFLOWIF             /*!< TIMER counter overflow interrupt flag */
#define TIMER_FLAG_MCH0                                    TIMER_INTF_MCH0IF                 /*!< multi mode channel 0 capture or compare flag */
#define TIMER_FLAG_MCH1                                    TIMER_INTF_MCH1IF                 /*!< multi mode channel 1 capture or compare flag */
#define TIMER_FLAG_MCH2                                    TIMER_INTF_MCH2IF                 /*!< multi mode channel 2 capture or compare flag */
#define TIMER_FLAG_MCH3                                    TIMER_INTF_MCH3IF                 /*!< multi mode channel 3 capture or compare flag */
#define TIMER_FLAG_MCH0O                                   TIMER_INTF_MCH0OF                 /*!< multi mode channel 0 overcapture flag */
#define TIMER_FLAG_MCH1O                                   TIMER_INTF_MCH1OF                 /*!< multi mode channel 1 overcapture flag */
#define TIMER_FLAG_MCH2O                                   TIMER_INTF_MCH2OF                 /*!< multi mode channel 2 overcapture flag */
#define TIMER_FLAG_MCH3O                                   TIMER_INTF_MCH3OF                 /*!< multi mode channel 3 overcapture flag */
#define TIMER_FLAG_CH0COMADD                               TIMER_INTF_CH0COMADDIF            /*!< channel 0 additional compare interrupt flag */
#define TIMER_FLAG_CH1COMADD                               TIMER_INTF_CH1COMADDIF            /*!< channel 1 additional compare interrupt flag */
#define TIMER_FLAG_CH2COMADD                               TIMER_INTF_CH2COMADDIF            /*!< channel 2 additional compare interrupt flag */
#define TIMER_FLAG_CH3COMADD                               TIMER_INTF_CH3COMADDIF            /*!< channel 3 additional compare interrupt flag */

/* TIMER DMA source */
#define TIMER_DMA_UPD                                      TIMER_DMAINTEN_UPDEN              /*!< update DMA request */
#define TIMER_DMA_CH0D                                     TIMER_DMAINTEN_CH0DEN             /*!< channel 0 capture or compare DMA request */
#define TIMER_DMA_CH1D                                     TIMER_DMAINTEN_CH1DEN             /*!< channel 1 capture or compare DMA request */
#define TIMER_DMA_CH2D                                     TIMER_DMAINTEN_CH2DEN             /*!< channel 2 capture or compare DMA request */
#define TIMER_DMA_CH3D                                     TIMER_DMAINTEN_CH3DEN             /*!< channel 3 capture or compare DMA request */
#define TIMER_DMA_CMTD                                     TIMER_DMAINTEN_CMTDEN             /*!< commutation DMA request */
#define TIMER_DMA_TRGD                                     TIMER_DMAINTEN_TRGDEN             /*!< trigger DMA request */
#define TIMER_DMA_MCH0D                                    TIMER_DMAINTEN_MCH0DEN            /*!< multi mode channel 0 capture or compare DMA request */
#define TIMER_DMA_MCH1D                                    TIMER_DMAINTEN_MCH1DEN            /*!< multi mode channel 1 capture or compare DMA request */
#define TIMER_DMA_MCH2D                                    TIMER_DMAINTEN_MCH2DEN            /*!< multi mode channel 2 capture or compare DMA request */
#define TIMER_DMA_MCH3D                                    TIMER_DMAINTEN_MCH3DEN            /*!< multi mode channel 3 capture or compare DMA request */

