burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_timer.h
/* channel DMA request source selection */
#define TIMER_DMAREQUEST_CHANNELEVENT                      ((uint32_t)0x00000000U)           /*!< DMA request of channel y is sent when channel y event occurs */
#define TIMER_DMAREQUEST_UPDATEEVENT                       ((uint32_t)0x00000001U)           /*!< DMA request of channel y is sent when update event occurs */

/* DMA access base address */
#define DMACFG_DMATA(regval)                               (BITS(0, 5) & ((uint32_t)(regval) << 0U))
#define TIMER_DMACFG_DMATA_CTL0                            DMACFG_DMATA(0)                   /*!< DMA transfer address is TIMER_CTL0 */
#define TIMER_DMACFG_DMATA_CTL1                            DMACFG_DMATA(1)                   /*!< DMA transfer address is TIMER_CTL1 */
#define TIMER_DMACFG_DMATA_SMCFG                           DMACFG_DMATA(2)                   /*!< DMA transfer address is TIMER_SMCFG */
#define TIMER_DMACFG_DMATA_DMAINTEN                        DMACFG_DMATA(3)                   /*!< DMA transfer address is TIMER_DMAINTEN */
#define TIMER_DMACFG_DMATA_INTF                            DMACFG_DMATA(4)                   /*!< DMA transfer address is TIMER_INTF */
#define TIMER_DMACFG_DMATA_SWEVG                           DMACFG_DMATA(5)                   /*!< DMA transfer address is TIMER_SWEVG */
#define TIMER_DMACFG_DMATA_CHCTL0                          DMACFG_DMATA(6)                   /*!< DMA transfer address is TIMER_CHCTL0 */
#define TIMER_DMACFG_DMATA_CHCTL1                          DMACFG_DMATA(7)                   /*!< DMA transfer address is TIMER_CHCTL1 */
#define TIMER_DMACFG_DMATA_CHCTL2                          DMACFG_DMATA(8)                   /*!< DMA transfer address is TIMER_CHCTL2 */
#define TIMER_DMACFG_DMATA_CNT                             DMACFG_DMATA(9)                   /*!< DMA transfer address is TIMER_CNT */
#define TIMER_DMACFG_DMATA_PSC                             DMACFG_DMATA(10)                  /*!< DMA transfer address is TIMER_PSC */
#define TIMER_DMACFG_DMATA_CAR                             DMACFG_DMATA(11)                  /*!< DMA transfer address is TIMER_CAR */
#define TIMER_DMACFG_DMATA_CREP                            DMACFG_DMATA(12)                  /*!< DMA transfer address is TIMER_CREP */
#define TIMER_DMACFG_DMATA_CH0CV                           DMACFG_DMATA(13)                  /*!< DMA transfer address is TIMER_CH0CV */
#define TIMER_DMACFG_DMATA_CH1CV                           DMACFG_DMATA(14)                  /*!< DMA transfer address is TIMER_CH1CV */
#define TIMER_DMACFG_DMATA_CH2CV                           DMACFG_DMATA(15)                  /*!< DMA transfer address is TIMER_CH2CV */
#define TIMER_DMACFG_DMATA_CH3CV                           DMACFG_DMATA(16)                  /*!< DMA transfer address is TIMER_CH3CV */
#define TIMER_DMACFG_DMATA_CCHP                            DMACFG_DMATA(17)                  /*!< DMA transfer address is TIMER_CCHP */
#define TIMER_DMACFG_DMATA_MCHCTL0                         DMACFG_DMATA(18)                  /*!< DMA transfer address is TIMER_MCHCTL0 */
#define TIMER_DMACFG_DMATA_MCHCTL1                         DMACFG_DMATA(19)                  /*!< DMA transfer address is TIMER_MCHCTL1 */
#define TIMER_DMACFG_DMATA_MCHCTL2                         DMACFG_DMATA(20)                  /*!< DMA transfer address is TIMER_MCHCTL2 */
#define TIMER_DMACFG_DMATA_MCH0CV                          DMACFG_DMATA(21)                  /*!< DMA transfer address is TIMER_MCH0CV */
#define TIMER_DMACFG_DMATA_MCH1CV                          DMACFG_DMATA(22)                  /*!< DMA transfer address is TIMER_MCH1CV */
#define TIMER_DMACFG_DMATA_MCH2CV                          DMACFG_DMATA(23)                  /*!< DMA transfer address is TIMER_MCH2CV */
#define TIMER_DMACFG_DMATA_MCH3CV                          DMACFG_DMATA(24)                  /*!< DMA transfer address is TIMER_MCH3CV */
#define TIMER_DMACFG_DMATA_CH0COMV_ADD                     DMACFG_DMATA(25)                  /*!< DMA transfer address is TIMER_CH0COMV_ADD */
#define TIMER_DMACFG_DMATA_CH1COMV_ADD                     DMACFG_DMATA(26)                  /*!< DMA transfer address is TIMER_CH1COMV_ADD */
#define TIMER_DMACFG_DMATA_CH2COMV_ADD                     DMACFG_DMATA(27)                  /*!< DMA transfer address is TIMER_CH2COMV_ADD */
#define TIMER_DMACFG_DMATA_CH3COMV_ADD                     DMACFG_DMATA(28)                  /*!< DMA transfer address is TIMER_CH3COMV_ADD */
#define TIMER_DMACFG_DMATA_CTL2                            DMACFG_DMATA(29)                  /*!< DMA transfer address is TIMER_CTL2 */
#define TIMER_DMACFG_DMATA_AFCTL                           DMACFG_DMATA(35)                  /*!< DMA transfer address is TIMER_AFCTL1 */
#define TIMER_DMACFG_DMATA_IREP                            DMACFG_DMATA(36)                  /*!< DMA transfer address is TIMER_IREP */
#define TIMER_DMACFG_DMATA_ADCRCTL                         DMACFG_DMATA(37)                  /*!< DMA transfer address is TIMER_ADCRCTL */
#define TIMER_DMACFG_DMATA_ADCCR1                          DMACFG_DMATA(38)                  /*!< DMA transfer address is TIMER_ADCCR1 */
#define TIMER_DMACFG_DMATA_ADCCR2                          DMACFG_DMATA(39)                  /*!< DMA transfer address is TIMER_ADCCR2 */
#define TIMER_DMACFG_DMATA_ADCREP                          DMACFG_DMATA(40)                  /*!< DMA transfer address is TIMER_ADCREP */
#define TIMER_DMACFG_DMATA_ADCTL                           DMACFG_DMATA(43)                  /*!< DMA transfer address is TIMER_ADCTL */
#define TIMER_DMACFG_DMATA_SHUPM0                          DMACFG_DMATA(49)                  /*!< DMA transfer address is TIMER_SHUPM0 */
#define TIMER_DMACFG_DMATA_SHUPM1                          DMACFG_DMATA(50)                  /*!< DMA transfer address is TIMER_SHUPM1 */
#define TIMER_DMACFG_DMATA_COUMSEL                         DMACFG_DMATA(51)                  /*!< DMA transfer address is TIMER_COUMSEL */

/* DMA access burst length */
#define DMACFG_DMATC(regval)                               (BITS(8, 13) & ((uint32_t)(regval) << 8U))
#define TIMER_DMACFG_DMATC_1TRANSFER                       DMACFG_DMATC(0)                   /*!< DMA transfer 1 time */
#define TIMER_DMACFG_DMATC_2TRANSFER                       DMACFG_DMATC(1)                   /*!< DMA transfer 2 times */
#define TIMER_DMACFG_DMATC_3TRANSFER                       DMACFG_DMATC(2)                   /*!< DMA transfer 3 times */
#define TIMER_DMACFG_DMATC_4TRANSFER                       DMACFG_DMATC(3)                   /*!< DMA transfer 4 times */
#define TIMER_DMACFG_DMATC_5TRANSFER                       DMACFG_DMATC(4)                   /*!< DMA transfer 5 times */
#define TIMER_DMACFG_DMATC_6TRANSFER                       DMACFG_DMATC(5)                   /*!< DMA transfer 6 times */
#define TIMER_DMACFG_DMATC_7TRANSFER                       DMACFG_DMATC(6)                   /*!< DMA transfer 7 times */
#define TIMER_DMACFG_DMATC_8TRANSFER                       DMACFG_DMATC(7)                   /*!< DMA transfer 8 times */
#define TIMER_DMACFG_DMATC_9TRANSFER                       DMACFG_DMATC(8)                   /*!< DMA transfer 9 times */
#define TIMER_DMACFG_DMATC_10TRANSFER                      DMACFG_DMATC(9)                   /*!< DMA transfer 10 times */
#define TIMER_DMACFG_DMATC_11TRANSFER                      DMACFG_DMATC(10)                  /*!< DMA transfer 11 times */
#define TIMER_DMACFG_DMATC_12TRANSFER                      DMACFG_DMATC(11)                  /*!< DMA transfer 12 times */
#define TIMER_DMACFG_DMATC_13TRANSFER                      DMACFG_DMATC(12)                  /*!< DMA transfer 13 times */
#define TIMER_DMACFG_DMATC_14TRANSFER                      DMACFG_DMATC(13)                  /*!< DMA transfer 14 times */
#define TIMER_DMACFG_DMATC_15TRANSFER                      DMACFG_DMATC(14)                  /*!< DMA transfer 15 times */
#define TIMER_DMACFG_DMATC_16TRANSFER                      DMACFG_DMATC(15)                  /*!< DMA transfer 16 times */
#define TIMER_DMACFG_DMATC_17TRANSFER                      DMACFG_DMATC(16)                  /*!< DMA transfer 17 times */
#define TIMER_DMACFG_DMATC_18TRANSFER                      DMACFG_DMATC(17)                  /*!< DMA transfer 18 times */
#define TIMER_DMACFG_DMATC_19TRANSFER                      DMACFG_DMATC(18)                  /*!< DMA transfer 19 times */
#define TIMER_DMACFG_DMATC_20TRANSFER                      DMACFG_DMATC(19)                  /*!< DMA transfer 20 times */
#define TIMER_DMACFG_DMATC_21TRANSFER                      DMACFG_DMATC(20)                  /*!< DMA transfer 21 times */
#define TIMER_DMACFG_DMATC_22TRANSFER                      DMACFG_DMATC(21)                  /*!< DMA transfer 22 times */
#define TIMER_DMACFG_DMATC_23TRANSFER                      DMACFG_DMATC(22)                  /*!< DMA transfer 23 times */
#define TIMER_DMACFG_DMATC_24TRANSFER                      DMACFG_DMATC(23)                  /*!< DMA transfer 24 times */
#define TIMER_DMACFG_DMATC_25TRANSFER                      DMACFG_DMATC(24)                  /*!< DMA transfer 25 times */
#define TIMER_DMACFG_DMATC_26TRANSFER                      DMACFG_DMATC(25)                  /*!< DMA transfer 26 times */
#define TIMER_DMACFG_DMATC_27TRANSFER                      DMACFG_DMATC(26)                  /*!< DMA transfer 27 times */
#define TIMER_DMACFG_DMATC_28TRANSFER                      DMACFG_DMATC(27)                  /*!< DMA transfer 28 times */
#define TIMER_DMACFG_DMATC_29TRANSFER                      DMACFG_DMATC(28)                  /*!< DMA transfer 29 times */
#define TIMER_DMACFG_DMATC_30TRANSFER                      DMACFG_DMATC(29)                  /*!< DMA transfer 30 times */
#define TIMER_DMACFG_DMATC_31TRANSFER                      DMACFG_DMATC(30)                  /*!< DMA transfer 31 times */
#define TIMER_DMACFG_DMATC_32TRANSFER                      DMACFG_DMATC(31)                  /*!< DMA transfer 32 times */
#define TIMER_DMACFG_DMATC_33TRANSFER                      DMACFG_DMATC(32)                  /*!< DMA transfer 33 times */
#define TIMER_DMACFG_DMATC_34TRANSFER                      DMACFG_DMATC(33)                  /*!< DMA transfer 34 times */
#define TIMER_DMACFG_DMATC_35TRANSFER                      DMACFG_DMATC(34)                  /*!< DMA transfer 35 times */
#define TIMER_DMACFG_DMATC_36TRANSFER                      DMACFG_DMATC(35)                  /*!< DMA transfer 36 times */
#define TIMER_DMACFG_DMATC_37TRANSFER                      DMACFG_DMATC(36)                  /*!< DMA transfer 37 times */
#define TIMER_DMACFG_DMATC_38TRANSFER                      DMACFG_DMATC(37)                  /*!< DMA transfer 38 times */
#define TIMER_DMACFG_DMATC_39TRANSFER                      DMACFG_DMATC(38)                  /*!< DMA transfer 39 times */
#define TIMER_DMACFG_DMATC_40TRANSFER                      DMACFG_DMATC(39)                  /*!< DMA transfer 40 times */
#define TIMER_DMACFG_DMATC_41TRANSFER                      DMACFG_DMATC(40)                  /*!< DMA transfer 41 times */
#define TIMER_DMACFG_DMATC_42TRANSFER                      DMACFG_DMATC(41)                  /*!< DMA transfer 42 times */
#define TIMER_DMACFG_DMATC_43TRANSFER                      DMACFG_DMATC(42)                  /*!< DMA transfer 43 times */
#define TIMER_DMACFG_DMATC_44TRANSFER                      DMACFG_DMATC(43)                  /*!< DMA transfer 44 times */
#define TIMER_DMACFG_DMATC_45TRANSFER                      DMACFG_DMATC(44)                  /*!< DMA transfer 45 times */
#define TIMER_DMACFG_DMATC_46TRANSFER                      DMACFG_DMATC(45)                  /*!< DMA transfer 46 times */
#define TIMER_DMACFG_DMATC_47TRANSFER                      DMACFG_DMATC(46)                  /*!< DMA transfer 47 times */
#define TIMER_DMACFG_DMATC_48TRANSFER                      DMACFG_DMATC(47)                  /*!< DMA transfer 48 times */
#define TIMER_DMACFG_DMATC_49TRANSFER                      DMACFG_DMATC(48)                  /*!< DMA transfer 49 times */
#define TIMER_DMACFG_DMATC_50TRANSFER                      DMACFG_DMATC(49)                  /*!< DMA transfer 50 times */
#define TIMER_DMACFG_DMATC_51TRANSFER                      DMACFG_DMATC(50)                  /*!< DMA transfer 51 times */
#define TIMER_DMACFG_DMATC_52TRANSFER                      DMACFG_DMATC(51)                  /*!< DMA transfer 51 times */

