burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_timer.h
/* TIMER software event generation source */
#define TIMER_EVENT_SRC_UPG                                TIMER_SWEVG_UPG                   /*!< update event generation */
#define TIMER_EVENT_SRC_CH0G                               TIMER_SWEVG_CH0G                  /*!< channel 0 capture or compare event generation */
#define TIMER_EVENT_SRC_CH1G                               TIMER_SWEVG_CH1G                  /*!< channel 1 capture or compare event generation */
#define TIMER_EVENT_SRC_CH2G                               TIMER_SWEVG_CH2G                  /*!< channel 2 capture or compare event generation */
#define TIMER_EVENT_SRC_CH3G                               TIMER_SWEVG_CH3G                  /*!< channel 3 capture or compare event generation */
#define TIMER_EVENT_SRC_CMTG                               TIMER_SWEVG_CMTG                  /*!< channel commutation event generation */
#define TIMER_EVENT_SRC_TRGG                               TIMER_SWEVG_TRGG                  /*!< trigger event generation */
#define TIMER_EVENT_SRC_BRKG                               TIMER_SWEVG_BRKG                  /*!< break event generation */
#define TIMER_EVENT_SRC_MCH0G                              TIMER_SWEVG_MCH0G                 /*!< multi mode channel 0 capture or compare event generation */
#define TIMER_EVENT_SRC_MCH1G                              TIMER_SWEVG_MCH1G                 /*!< multi mode channel 1 capture or compare event generation */
#define TIMER_EVENT_SRC_MCH2G                              TIMER_SWEVG_MCH2G                 /*!< multi mode channel 2 capture or compare event generation */
#define TIMER_EVENT_SRC_MCH3G                              TIMER_SWEVG_MCH3G                 /*!< multi mode channel 3 capture or compare event generation */
#define TIMER_EVENT_SRC_CH0COMADDG                         TIMER_SWEVG_CH0COMADDG            /*!< channel 0 additional compare event generation */
#define TIMER_EVENT_SRC_CH1COMADDG                         TIMER_SWEVG_CH1COMADDG            /*!< channel 1 additional compare event generation */
#define TIMER_EVENT_SRC_CH2COMADDG                         TIMER_SWEVG_CH2COMADDG            /*!< channel 2 additional compare event generation */
#define TIMER_EVENT_SRC_CH3COMADDG                         TIMER_SWEVG_CH3COMADDG            /*!< channel 3 additional compare event generation */

/* center-aligned mode selection */
#define CTL0_CAM(regval)                                   ((uint32_t)(BITS(5, 6) & ((uint32_t)(regval) << 5U)))
#define TIMER_COUNTER_EDGE                                 CTL0_CAM(0)                       /*!< edge-aligned mode */
#define TIMER_COUNTER_CENTER_DOWN                          CTL0_CAM(1)                       /*!< center-aligned and counting down assert mode */
#define TIMER_COUNTER_CENTER_UP                            CTL0_CAM(2)                       /*!< center-aligned and counting up assert mode */
#define TIMER_COUNTER_CENTER_BOTH                          CTL0_CAM(3)                       /*!< center-aligned and counting up/down assert mode */

#define TIMER_PSC_RELOAD_NOW                               ((uint32_t)0x00000000U)           /*!< the prescaler is loaded right now */
#define TIMER_PSC_RELOAD_UPDATE                            ((uint32_t)0x00000001U)           /*!< the prescaler is loaded at next update event */

/* count direction */
#define TIMER_COUNTER_UP                                   ((uint32_t)0x0000U)               /*!< counter up direction */
#define TIMER_COUNTER_DOWN                                 ((uint32_t)TIMER_CTL0_DIR)        /*!< counter down direction */

/* specify division ratio between TIMER clock and dead-time and sampling clock */
#define CTL0_CKDIV(regval)                                 ((uint32_t)(BITS(8, 9) & ((uint32_t)(regval) << 8U)))
#define TIMER_CKDIV_DIV1                                   CTL0_CKDIV(0)                     /*!< clock division value is 1,fDTS=fTIMER_CK */
#define TIMER_CKDIV_DIV2                                   CTL0_CKDIV(1)                     /*!< clock division value is 2,fDTS= fTIMER_CK/2 */
#define TIMER_CKDIV_DIV4                                   CTL0_CKDIV(2)                     /*!< clock division value is 4, fDTS= fTIMER_CK/4 */

/* single pulse mode */
#define TIMER_SP_MODE_SINGLE                               ((uint32_t)0x00000000U)           /*!< single pulse mode */
#define TIMER_SP_MODE_REPETITIVE                           ((uint32_t)0x00000001U)           /*!< repetitive pulse mode */

/* update source */
#define TIMER_UPDATE_SRC_REGULAR                           ((uint32_t)0x00000000U)           /*!< update interrupt generate only by counter overflow/underflow */
#define TIMER_UPDATE_SRC_GLOBAL                            ((uint32_t)0x00000001U)           /*!< update interrupt generate by setting of UPG bit or the counter overflow/underflow,or the slave mode controller trigger */

/* update event source selection */
#define TIMER_UPDATE_EVENT_REGULAR                         ((uint32_t)0x00000000U)           /*!< update event generate only by counter overflow/underflow */
#define TIMER_UPDATE_EVENT_GLOBAL                          ((uint32_t)0x00000001U)           /*!< update event generate by setting of UPG bit or the counter overflow/underflow,or the slave mode controller trigger */

/* update source selection */
#define CTL0_UPS_SEL(regval)                               ((uint32_t)(BITS(30, 31)&((uint32_t)(regval) << 30U)))
#define TIMER_UPS_SEL_FLOW                                 CTL0_UPS_SEL(0)                   /*!< update event source select counter flow event */
#define TIMER_UPS_SEL_OVERFLOW                             CTL0_UPS_SEL(1)                   /*!< update event source select counter overflow event */
#define TIMER_UPS_SEL_UNDERFLOW                            CTL0_UPS_SEL(2)                   /*!< update event source select counter underflow event */

/* interrupt source selection*/
#define CTL0_INT_SEL(regval)                               ((uint32_t)(BITS(28, 29)&((uint32_t)(regval) << 28U)))
#define TIMER_INT_SEL_FLOW                                 CTL0_INT_SEL(0)                   /*!< interrupt source select counter flow event */
#define TIMER_INT_SEL_OVERFLOW                             CTL0_INT_SEL(1)                   /*!< interrupt source select counter overflow event */
#define TIMER_INT_SEL_UNDERFLOW                            CTL0_INT_SEL(2)                   /*!< interrupt source select counter underflow event */

/* etr source selection*/
#define CTL0_ETI_SEL(regval)                               ((uint32_t)(BITS(24, 25)&((uint32_t)(regval) << 24U)))
#define TIMER_ETI_SEL_ETI1                                 CTL0_ETI_SEL(0)                   /*!< TIMERX etr source select TIMER_ETI1 */
#define TIMER_ETI_SEL_ETI2                                 CTL0_ETI_SEL(1)                   /*!< TIMERX etr source select TIMER_ETI2 */
#define TIMER_ETI_SEL_ETI3                                 CTL0_ETI_SEL(2)                   /*!< TIMERX etr source select TIMER_ETI3 */
#define TIMER_ETI_SEL_ETI4                                 CTL0_ETI_SEL(3)                   /*!< TIMERX etr source select TIMER_ETI4 */

/* run mode off-state configure */
#define TIMER_ROS_STATE_ENABLE                             ((uint16_t)TIMER_CCHP_ROS)        /*!< when POEN bit is set, the channel output signals (CHx_O/CHx_ON) are enabled, with relationship to CHxEN/CHxNEN bits */
#define TIMER_ROS_STATE_DISABLE                            ((uint16_t)0x0000U)               /*!< when POEN bit is set, the channel output signals (CHx_O/CHx_ON) are disabled */

