burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_timer.h
/* idle mode off-state configure */
#define TIMER_IOS_STATE_ENABLE                             ((uint16_t)TIMER_CCHP_IOS)        /*!< when POEN bit is reset, he channel output signals (CHx_O/CHx_ON) are enabled, with relationship to CHxEN/CHxNEN bits */
#define TIMER_IOS_STATE_DISABLE                            ((uint16_t)0x0000U)               /*!< when POEN bit is reset, the channel output signals (CHx_O/CHx_ON) are disabled */

/* break input polarity */
#define TIMER_BREAK_POLARITY_LOW                           ((uint16_t)0x0000U)               /*!< break input polarity is low */
#define TIMER_BREAK_POLARITY_HIGH                          ((uint16_t)TIMER_CCHP_BRKP)       /*!< break input polarity is high */

/* output automatic enable */
#define TIMER_OUTAUTO_ENABLE                               ((uint16_t)TIMER_CCHP_OAEN)       /*!< output automatic enable */
#define TIMER_OUTAUTO_DISABLE                              ((uint16_t)0x0000U)               /*!< output automatic disable */

/* complementary register protect control */
#define CCHP_PROT(regval)                                  ((uint16_t)(BITS(8, 9) & ((uint32_t)(regval) << 8U)))
#define TIMER_CCHP_PROT_OFF                                CCHP_PROT(0)                      /*!< protect disable */
#define TIMER_CCHP_PROT_0                                  CCHP_PROT(1)                      /*!< PROT mode 0 */
#define TIMER_CCHP_PROT_1                                  CCHP_PROT(2)                      /*!< PROT mode 1 */
#define TIMER_CCHP_PROT_2                                  CCHP_PROT(3)                      /*!< PROT mode 2 */

/* break input enable */
#define TIMER_BREAK_ENABLE                                 ((uint16_t)TIMER_CCHP_BRKEN)      /*!< break input enable */
#define TIMER_BREAK_DISABLE                                ((uint16_t)0x0000U)               /*!< break input disable */

/* TIMER channel n(n=0,1,2,3) */
#define TIMER_CH_0                                         ((uint16_t)0x0000U)               /*!< TIMER channel 0 */
#define TIMER_CH_1                                         ((uint16_t)0x0001U)               /*!< TIMER channel 1 */
#define TIMER_CH_2                                         ((uint16_t)0x0002U)               /*!< TIMER channel 2 */
#define TIMER_CH_3                                         ((uint16_t)0x0003U)               /*!< TIMER channel 3 */
#define TIMER_MCH_0                                        ((uint16_t)0x0010U)               /*!< TIMER multi mode channel 0 */
#define TIMER_MCH_1                                        ((uint16_t)0x0011U)               /*!< TIMER multi mode channel 1 */
#define TIMER_MCH_2                                        ((uint16_t)0x0012U)               /*!< TIMER multi mode channel 2 */
#define TIMER_MCH_3                                        ((uint16_t)0x0013U)               /*!< TIMER multi mode channel 3 */

/* channel enable state */
#define TIMER_CCX_ENABLE                                   ((uint16_t)0x0001U)               /*!< channel enable */
#define TIMER_CCX_DISABLE                                  ((uint16_t)0x0000U)               /*!< channel disable */

/* channel complementary output enable state */
#define TIMER_CCXN_ENABLE                                  ((uint16_t)0x0004U)               /*!< channel complementary enable */
#define TIMER_CCXN_DISABLE                                 ((uint16_t)0x0000U)               /*!< channel complementary disable */

/* multi mode channel enable state */
#define TIMER_MCCX_ENABLE                                  ((uint16_t)0x0004U)               /*!< multi mode channel enable */
#define TIMER_MCCX_DISABLE                                 ((uint16_t)0x0000U)               /*!< multi mode channel disable */

/* channel output polarity */
#define TIMER_OC_POLARITY_HIGH                             ((uint16_t)0x0000U)               /*!< channel output polarity is high */
#define TIMER_OC_POLARITY_LOW                              ((uint16_t)0x0002U)               /*!< channel output polarity is low */

/* channel complementary output polarity */
#define TIMER_OCN_POLARITY_HIGH                            ((uint16_t)0x0000U)               /*!< channel complementary output polarity is high */
#define TIMER_OCN_POLARITY_LOW                             ((uint16_t)0x0008U)               /*!< channel complementary output polarity is low */

/* multi mode channel output polarity */
#define TIMER_OMC_POLARITY_HIGH                            ((uint16_t)0x0000U)               /*!< multi mode channel output polarity is high */
#define TIMER_OMC_POLARITY_LOW                             ((uint16_t)0x0001U)               /*!< multi mode channel output polarity is low */

/* idle state of channel output */
#define TIMER_OC_IDLE_STATE_HIGH                           ((uint16_t)0x0100U)               /*!< idle state of channel output is high */
#define TIMER_OC_IDLE_STATE_LOW                            ((uint16_t)0x0000U)               /*!< idle state of channel output is low */

/* idle state of channel complementary output */
#define TIMER_OCN_IDLE_STATE_HIGH                          ((uint16_t)0x0200U)               /*!< idle state of channel complementary output is high */
#define TIMER_OCN_IDLE_STATE_LOW                           ((uint16_t)0x0000U)               /*!< idle state of channel complementary output is low */

/* idle state of multi mode channel output */
#define TIMER_OMC_IDLE_STATE_HIGH                          ((uint16_t)0x0100U)               /*!< idle state of multi mode channel output is high */
#define TIMER_OMC_IDLE_STATE_LOW                           ((uint16_t)0x0000U)               /*!< idle state of multi mode channel output is low */

/* channel output compare mode */
#define TIMER_OC_MODE(regval)                              ((BITS(4, 6) & ((uint32_t)(regval) << 4U)) | (BIT(16) & ((uint32_t)(regval) << 13U)))
#define TIMER_OC_MODE_TIMING                               (TIMER_OC_MODE(0))                /*!< timing mode */
#define TIMER_OC_MODE_ACTIVE                               (TIMER_OC_MODE(1))                /*!< active mode */
#define TIMER_OC_MODE_INACTIVE                             (TIMER_OC_MODE(2))                /*!< inactive mode */
#define TIMER_OC_MODE_TOGGLE                               (TIMER_OC_MODE(3))                /*!< toggle mode */
#define TIMER_OC_MODE_LOW                                  (TIMER_OC_MODE(4))                /*!< force low mode */
#define TIMER_OC_MODE_HIGH                                 (TIMER_OC_MODE(5))                /*!< force high mode */
#define TIMER_OC_MODE_PWM0                                 (TIMER_OC_MODE(6))                /*!< PWM0 mode */
#define TIMER_OC_MODE_PWM1                                 (TIMER_OC_MODE(7))                /*!< PWM1 mode */
#define TIMER_OC_MODE_COMPOSITE_PWM0                       (TIMER_OC_MODE(8))                /*!< COMPOSITE pwm mode0 */
#define TIMER_OC_MODE_COMPOSITE_PWM1                       (TIMER_OC_MODE(9))                /*!< COMPOSITE pwm mode1 */
#define TIMER_OC_MODE_ASYMMETRIC_PWM0                      (TIMER_OC_MODE(10))               /*!< ASYMMETRIC pwm mode0 */
#define TIMER_OC_MODE_ASYMMETRIC_PWM1                      (TIMER_OC_MODE(11))               /*!< ASYMMETRIC pwm mode1 */

/* channel output compare shadow enable */
#define TIMER_OC_SHADOW_ENABLE                             ((uint16_t)0x0008U)               /*!< channel output shadow state enable */
#define TIMER_OC_SHADOW_DISABLE                            ((uint16_t)0x0000U)               /*!< channel output shadow state disable */

/* channel output compare fast enable */
#define TIMER_OC_FAST_ENABLE                               ((uint16_t)0x0004U)                /*!< channel output fast function enable */
#define TIMER_OC_FAST_DISABLE                              ((uint16_t)0x0000U)                /*!< channel output fast function disable */

