burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_timer.h
/* channel output compare clear enable */
#define TIMER_OC_CLEAR_ENABLE                              ((uint16_t)0x0080U)               /*!< channel output clear function enable */
#define TIMER_OC_CLEAR_DISABLE                             ((uint16_t)0x0000U)               /*!< channel output clear function disable */

/* channel control shadow register update control */
#define CTL1_CCUC(regval)                                  ((BIT(2) & ((uint32_t)(regval) << 2U)) | (BITS(30, 31) & ((uint32_t)(regval) << 29U)))
#define TIMER_UPDATECTL_CCU                                CTL1_CCUC(0)                      /*!< the shadow registers update by when CMTG bit is set */
#define TIMER_UPDATECTL_CCUTRI                             CTL1_CCUC(1)                      /*!< the shadow registers update by when CMTG bit is set or an rising edge of TRGI occurs */
#define TIMER_UPDATECTL_CCUOVERFLOW                        CTL1_CCUC(4)                      /*!< the shadow registers update by when the overflow event occurs */
#define TIMER_UPDATECTL_CCUUNDERFLOW                       CTL1_CCUC(5)                      /*!< the shadow registers update by when the underflow event occurs */
#define TIMER_UPDATECTL_CCUFLOW                            CTL1_CCUC(6)                      /*!< the shadow registers update by when the overflow or underflow event occurs */

/* channel input capture polarity */
#define TIMER_IC_POLARITY_RISING                           ((uint16_t)0x0000U)               /*!< input capture rising edge */
#define TIMER_IC_POLARITY_FALLING                          ((uint16_t)0x0002U)               /*!< input capture falling edge */
#define TIMER_IC_POLARITY_BOTH_EDGE                        ((uint16_t)0x000AU)               /*!< input capture both edge */

/* TIMER input capture selection */
#define TIMER_IC_SELECTION_DIRECTTI                        ((uint32_t)0x0001U)               /*!< channel y is configured as input and icy is mapped on CIy */
#define TIMER_IC_SELECTION_INDIRECTTI                      ((uint32_t)0x0002U)               /*!< channel y is configured as input and icy is mapped on opposite input */
#define TIMER_IC_SELECTION_ITS                             ((uint32_t)0x0003U)               /*!< channel y is configured as input and icy is mapped on ITS */
#define TIMER_IC_SELECTION_PAIR                            ((uint16_t)0x0004U)               /*!< channel n is configured as input and icy is mapped on the other channel of same pair */

/* channel input capture prescaler */
#define TIMER_IC_PSC_DIV1                                  ((uint16_t)0x0000U)               /*!< no prescaler */
#define TIMER_IC_PSC_DIV2                                  ((uint16_t)0x0004U)               /*!< divided by 2 */
#define TIMER_IC_PSC_DIV4                                  ((uint16_t)0x0008U)               /*!< divided by 4 */
#define TIMER_IC_PSC_DIV8                                  ((uint16_t)0x000CU)               /*!< divided by 8 */

/* ocref source selection */
#define TIMER_SMCFG_OCPRE_ETI                              ((uint32_t)TIMER_SMCFG_OCRC)      /*!< external other peripheral input */
#define TIMER_SMCFG_OCPRE_CLR_INPUT                        ((uint32_t)0x00000000U)           /*!< external pin input */

/* master mode control */
#define CTL1_MMC(regval)                                   ((BITS(4, 6) & ((uint32_t)(regval) << 4U))|((BIT(25) & (uint32_t)(regval) << 22)))
#define TIMER_TRI_OUT_SRC_RESET                            CTL1_MMC(0)                       /*!< the UPG bit as trigger output */
#define TIMER_TRI_OUT_SRC_ENABLE                           CTL1_MMC(1)                       /*!< the counter enable signal TIMER_CTL0_CEN as trigger output */
#define TIMER_TRI_OUT_SRC_UPDATE                           CTL1_MMC(2)                       /*!< update event as trigger output */
#define TIMER_TRI_OUT_SRC_CH0                              CTL1_MMC(3)                       /*!< a capture or a compare match occurred in channel 0 as trigger output TRGO */
#define TIMER_TRI_OUT_SRC_O0CPRE                           CTL1_MMC(4)                       /*!< O0CPRE as trigger output */
#define TIMER_TRI_OUT_SRC_O1CPRE                           CTL1_MMC(5)                       /*!< O1CPRE as trigger output */
#define TIMER_TRI_OUT_SRC_O2CPRE                           CTL1_MMC(6)                       /*!< O2CPRE as trigger output */
#define TIMER_TRI_OUT_SRC_O3CPRE                           CTL1_MMC(7)                       /*!< O3CPRE as trigger output */

/* master slave mode selection */
#define TIMER_MASTER_SLAVE_MODE_ENABLE                     ((uint32_t)0x00000001U)           /*!< master slave mode enable */
#define TIMER_MASTER_SLAVE_MODE_DISABLE                    ((uint32_t)0x00000000U)           /*!< master slave mode disable */

/* external trigger prescaler */
#define SMCFG_ETPSC(regval)                                (BITS(12, 13) & ((uint32_t)(regval) << 12U))
#define TIMER_EXT_TRI_PSC_OFF                              SMCFG_ETPSC(0)                    /*!< no divided */
#define TIMER_EXT_TRI_PSC_DIV2                             SMCFG_ETPSC(1)                    /*!< divided by 2 */
#define TIMER_EXT_TRI_PSC_DIV4                             SMCFG_ETPSC(2)                    /*!< divided by 4 */
#define TIMER_EXT_TRI_PSC_DIV8                             SMCFG_ETPSC(3)                    /*!< divided by 8 */

/* external trigger polarity */
#define TIMER_ETP_FALLING                                  ((uint32_t)TIMER_SMCFG_ETP)       /*!< active low or falling edge active */
#define TIMER_ETP_RISING                                   ((uint32_t)0x00000000U)           /*!< active high or rising edge active */

/* channel 0 trigger input selection */
#define TIMER_HALLINTERFACE_ENABLE                         ((uint32_t)0x00000000U)           /*!< TIMER hall sensor mode enable */
#define TIMER_HALLINTERFACE_DISABLE                        ((uint32_t)0x00000001U)           /*!< TIMER hall sensor mode disable */

/* TIMERx(x=0,1,2,3,4,7) write cc register selection */
#define TIMER_CHVSEL_ENABLE                                ((uint16_t)0x0002U)               /*!< write CHxVAL register selection enable */
#define TIMER_CHVSEL_DISABLE                               ((uint16_t)0x0000U)               /*!< write CHxVAL register selection disable */

/* the output value selection */
#define TIMER_OUTSEL_ENABLE                                ((uint16_t)0x0001U)               /*!< output value selection enable */
#define TIMER_OUTSEL_DISABLE                               ((uint16_t)0x0000U)               /*!< output value selection disable */

/* channel additional output compare shadow enable */
#define TIMER_ADD_SHADOW_ENABLE                            ((uint16_t)0x0001U)               /*!< channel additional output shadow state enable */
#define TIMER_ADD_SHADOW_DISABLE                           ((uint16_t)0x0000U)               /*!< channel additional output shadow state disable */

/* channel output compare shadow enable */
#define TIMER_OMC_SHADOW_ENABLE                            ((uint16_t)0x0008U)               /*!< multi mode channel output shadow state enable */
#define TIMER_OMC_SHADOW_DISABLE                           ((uint16_t)0x0000U)               /*!< multi mode channel output shadow state disable */

/* channel output compare fast enable */
#define TIMER_OMC_FAST_ENABLE                              ((uint16_t)0x0004U)                /*!< channel output fast function enable */
#define TIMER_OMC_FAST_DISABLE                             ((uint16_t)0x0000U)                /*!< channel output fast function disable */

