burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_timer.h
/* channel output compare clear enable */
#define TIMER_OMC_CLEAR_ENABLE                             ((uint16_t)0x0080U)               /*!< multi mode channel output clear function enable */
#define TIMER_OMC_CLEAR_DISABLE                            ((uint16_t)0x0000U)               /*!< multi mode channel output clear function disable */

/* TIMER output value selection */
#define TIMER_PULSE_OUTPUT_NORMAL                          ((uint16_t)0x0000U)               /*!< channel output normal */
#define TIMER_PULSE_OUTPUT_CNT_UP                          ((uint16_t)0x0001U)               /*!< pulse output only when counting up */
#define TIMER_PULSE_OUTPUT_CNT_DOWN                        ((uint16_t)0x0002U)               /*!< pulse output only when counting down */
#define TIMER_PULSE_OUTPUT_CNT_BOTH                        ((uint16_t)0x0003U)               /*!< pulse output when counting up or down */
#define TIMER_PULSE_OUTPUT_MASK                            ((uint16_t)0x0003U)               /*!< pulse output mode mask */

/* multi mode channel input capture polarity */
#define TIMER_IMC_POLARITY_RISING                          ((uint16_t)0x0000U)               /*!< multi mode channel input capture rising edge */
#define TIMER_IMC_POLARITY_FALLING                         ((uint16_t)0x0001U)               /*!< multi mode channel input capture falling edge */
#define TIMER_IMC_POLARITY_BOTH_EDGE                       ((uint16_t)0x0003U)               /*!< multi mode channel input capture both edge */

/* TIMER multi mode channel mode selection */
#define TIMER_MCH_MODE_INDEPENDENTLY                       ((uint16_t)0x0000U)               /*!< multi mode channel work in independently mode */
#define TIMER_MCH_MODE_COMPLEMENTARY                       ((uint16_t)0x0003U)               /*!< multi mode channel work in complementary output mode */
#define TIMER_MCH_MODE_MASK                                ((uint16_t)0x0003U)               /*!< multi mode channel mode mask */

/* TIEMR break input pin polarity config */
#define TIMER_BRKIN_POLARITY_INVERTED                      TIMER_AFCTL_BRKIN0P               /*!< TIMER break external input polarity is active low */
#define TIMER_BRKIN_POLARITY_NONINVERTED                   ((uint16_t)0x0000U)               /*!< TIMER break external input polarity is active high */

/* TIEMR break input pin enable */
#define TIEMR_BRKIN_ENABLE                                 TIMER_AFCTL_BRKIN0E               /*!< TIMER break external input enable */
#define TIEMR_BRKIN_DISABLE                                ((uint16_t)0x0000U)               /*!< TIMER break external input disable */

/* TIMER break input from CMP source */
#define TIMER_BRKIN_CMP0                                   ((uint32_t)0x00000000U)               /*!< TIMER break CMP0 */
#define TIMER_BRKIN_CMP1                                   ((uint32_t)0x00000001U)               /*!< TIMER break CMP1 */
#define TIMER_BRKIN_CMP2                                   ((uint32_t)0x00000002U)               /*!< TIMER break CMP2 */
#define TIMER_BRKIN_CMP3                                   ((uint32_t)0x00000003U)               /*!< TIMER break CMP3 */

/* TIMER break input from CMP enable */
#define TIMER_BRKIN_CMP_ENABLE                             ((uint16_t)0x0000U)               /*!< TIMER break CMPx enable */
#define TIMER_BRKIN_CMP_DISABLE                            ((uint16_t)0x0001U)               /*!< TIMER break CMPx disable*/

/* TIMER break input from CMP polarity config */
#define TIMER_BRKIN_CMP_INVERTED                           ((uint16_t)0x0001U)               /*!< TIMER break input signal from CMP is inverted */
#define TIMER_BRKIN_CMP_NONINVERTED                        ((uint16_t)0x0000U)               /*!< TIMER break input signal from CMP is not inverted */

/* TIMER ocref_clr internal signal source selection */
#define AFCTL_OCRSEL(regval)                               (BITS(16, 18) & ((uint32_t)(regval) << 16U))
#define TIMER_OCPRE_CLR_CMP0                               AFCTL_OCRSEL(0)                   /*!< TIMER ocref_clr source select cmp0 */
#define TIMER_OCPRE_CLR_CMP1                               AFCTL_OCRSEL(1)                   /*!< TIMER ocref_clr source select cmp1 */
#define TIMER_OCPRE_CLR_CMP2                               AFCTL_OCRSEL(2)                   /*!< TIMER ocref_clr source select cmp2 */
#define TIMER_OCPRE_CLR_CMP3                               AFCTL_OCRSEL(3)                   /*!< TIMER ocref_clr source select cmp3 */

/* TIMER adc compare event repeation register select */
#define TIMER_ADC_COMPARE1                                 ((uint16_t)0x0000U)               /*!< select TIMER_ADCCR1 */
#define TIMER_ADC_COMPARE2                                 ((uint16_t)0x0001U)               /*!< select TIMER_ADCCR2 */

/* TIMER adc compare repeat source select */
#define TIMER_ADC_REPA                                     ((uint16_t)0x0000U)               /*!< select TIMER_ADCCR1 compare event reption register REPA */
#define TIMER_ADC_REPB                                     ((uint16_t)0x0001U)               /*!< select TIMER_ADCCR2 compare event reption register REPB */
#define TIMER_ADC_REPAB                                    ((uint16_t)0x0002U)               /*!< select TIMER_ADCCR1 or TIMER_ADCCR2 compare event reption register REPAB */

/* TIMER adc compare repeat counter decrement mode setting */
#define TIMER_ADC_REP_DEC_UNDERFLOW                        ((uint16_t)0x0000U)               /*!< ADC REPA/B decrement when cnt underflow */
#define TIMER_ADC_REP_DEC_OVERFLOW                         ((uint16_t)0x0001U)               /*!< ADC REPA/B decrement when cnt overflow */

/* TIMER shadow register selection */
#define TIMER_CH0CV_UPSEL                                  REGIDX_BIT(0, 0, 3)               /*!< select the TIMER_CH0CV register */
#define TIMER_CH0CV_ADD_UPSEL                              REGIDX_BIT(0, 3, 3)               /*!< select the TIMER_CH0COMV_ADD register */
#define TIMER_CH1CV_UPSEL                                  REGIDX_BIT(0, 6, 3)               /*!< select the TIMER_CH1CV register */
#define TIMER_CH1CV_ADD_UPSEL                              REGIDX_BIT(0, 9, 3)               /*!< select the TIMER_CH1COMV_ADD register */
#define TIMER_CH2CV_UPSEL                                  REGIDX_BIT(0, 12,3)               /*!< select the TIMER_CH2CV register */
#define TIMER_CH2CV_ADD_UPSEL                              REGIDX_BIT(0, 16,3)               /*!< select the TIMER_CH2COMV_ADD register */
#define TIMER_CH3CV_UPSEL                                  REGIDX_BIT(0, 19,3)               /*!< select the TIMER_CH3CV register */
#define TIMER_CH3CV_ADD_UPSEL                              REGIDX_BIT(0, 22,3)               /*!< select the TIMER_CH3COMV_ADD register */
#define TIMER_ADCCR1_UPSEL                                 REGIDX_BIT(0, 26,2)               /*!< select the TIMER_ADCCR1 register */
#define TIMER_ADCCR2_UPSEL                                 REGIDX_BIT(0, 28,2)               /*!< select the TIMER_ADCCR2 register */
#define TIMER_CAR_UPSEL                                    REGIDX_BIT(0, 30,2)               /*!< select the TIMER_CAR register */
#define TIMER_MCH0CV_UPSEL                                 REGIDX_BIT(1, 0, 2)               /*!< select the TIMER_MCH0CV register */
#define TIMER_MCH1CV_UPSEL                                 REGIDX_BIT(1, 2, 2)               /*!< select the TIMER_MCH1CV register */
#define TIMER_MCH2CV_UPSEL                                 REGIDX_BIT(1, 4, 2)               /*!< select the TIMER_MCH2CV register */
#define TIMER_MCH3CV_UPSEL                                 REGIDX_BIT(1, 6, 2)               /*!< select the TIMER_MCH3CV register */

/* TIMER register update event selection */
#define TIMER_UPDATE_MASK1                                 ((uint32_t)0x00000007U)               /*!< select the reg upmode mask1 */
#define TIMER_UPDATE_MASK2                                 ((uint32_t)0x00000003U)               /*!< select the reg upmode mask2 */
#define TIMER_UPDATE_GLOBAL                                ((uint32_t)0x00000000U)               /*!< select the reg upmode gloal reload */
#define TIMER_UPDATE_NEXT_OVERFLOW                         ((uint32_t)0x00000001U)               /*!< select the reg upmode at next overflow event */
#define TIMER_UPDATE_NEXT_UNDERFLOW                        ((uint32_t)0x00000002U)               /*!< select the reg upmode at next underflow event */
#define TIMER_UPDATE_NEXT_FLOW                             ((uint32_t)0x00000003U)               /*!< select the reg upmode at next flow event */
#define TIMER_UPDATE_NEXT_ADDCOMPARE_EVENT                 ((uint32_t)0x00000004U)               /*!< select the reg upmode at next add value compare event */

/* break automatic output function mode selection */
#define BRKAU_MODE(regval)                                 (BITS(2, 3) & ((uint32_t)(regval) << 2U))
#define TIMER_BRKAU_MODE_FLOW                              BRKAU_MODE(0)                     /*!< select the break auto recover at next flow event */
#define TIMER_BRKAU_MODE_OVERFLOW                          BRKAU_MODE(1)                     /*!< select the break auto recover at next overflow event */
#define TIMER_BRKAU_MODE_UNDERFLOW                         BRKAU_MODE(2)                     /*!< select the break auto recover at next underflow event */
#define TIMER_BRKAU_MODE_UPADATE_EVENT                     BRKAU_MODE(3)                     /*!< select the break auto recover at next update event */

/* reference signal output clear signal mode selection */
#define TIMER_REFCL_MODE_FLOW                              ((uint16_t)0x0000U)               /*!< select output clear recover at next flow event */
#define TIMER_REFCL_MODE_UPDATE_EVENT                      ((uint16_t)0x0003U)               /*!< select output clear recover at next update event */

/* function declarations */
/* TIMER timebase */
/* deinit a TIMER */
void timer_deinit(uint32_t timer_periph);
/* initialize TIMER init parameter struct */
void timer_struct_para_init(timer_parameter_struct *initpara);
/* initialize TIMER counter */
void timer_init(uint32_t timer_periph, timer_parameter_struct *initpara);
/* enable a TIMER */
void timer_enable(uint32_t timer_periph);
/* disable a TIMER */
void timer_disable(uint32_t timer_periph);
/* enable the auto reload shadow function */
void timer_auto_reload_shadow_enable(uint32_t timer_periph);
/* disable the auto reload shadow function */
void timer_auto_reload_shadow_disable(uint32_t timer_periph);
/* enable the update event */
void timer_update_event_enable(uint32_t timer_periph);
/* disable the update event */
void timer_update_event_disable(uint32_t timer_periph);
/* set TIMER counter alignment mode */
void timer_counter_alignment(uint32_t timer_periph, uint16_t aligned);
/* set TIMER counter up direction */
void timer_counter_up_direction(uint32_t timer_periph);
/* set TIMER counter down direction */
void timer_counter_down_direction(uint32_t timer_periph);
/* enable upif backup */
void timer_upif_backup_enable(uint32_t timer_periph);
/* disable upif backup */
void timer_upif_backup_disable(uint32_t timer_periph);
/* select the timer_interrupt source selection */
void timer_flow_interrupt_source_select(uint32_t timer_periph, uint32_t source);
/* select the timer update event source selection */
void timer_update_source_select(uint32_t timer_periph, uint32_t source);
/* select the TIMER ETI */
void timer_external_input_source_select(uint32_t timer_periph, uint32_t source);
/* configure TIMER prescaler */
void timer_prescaler_config(uint32_t timer_periph, uint16_t prescaler, uint32_t pscreload);
/* configure timer update repetition register value */
void timer_update_repetition_value_config(uint32_t timer_periph, uint16_t repetition);
/* configure timer flow interrupt repetition register value */
void timer_flow_interrupt_repetition_value_config(uint32_t timer_periph, uint16_t repetition);
/* flow interrupt repetition value reload */
void timer_flow_interrupt_repetition_value_reload(uint32_t timer_periph);
/* configure TIMER autoreload register value */
void timer_autoreload_value_config(uint32_t timer_periph, uint32_t autoreload);
/* get TIMER autoreload register value */
uint32_t timer_autoreload_value_read(uint32_t timer_periph);
/* configure TIMER counter register value */
void timer_counter_value_config(uint32_t timer_periph, uint32_t counter);
/* read TIMER counter value */
uint32_t timer_counter_read(uint32_t timer_periph);
/* read TIMER prescaler value */
uint16_t timer_prescaler_read(uint32_t timer_periph);
/* configure TIMER single pulse mode */
void timer_single_pulse_mode_config(uint32_t timer_periph, uint32_t spmode);
/* configure TIMER update event source */
void timer_update_source_config(uint32_t timer_periph, uint32_t update);
/* enable or disable channel capture/compare control shadow register */
void timer_channel_control_shadow_config(uint32_t timer_periph, ControlStatus newvalue);
/* configure TIMER channel control shadow register update control */
void timer_channel_control_shadow_update_config(uint32_t timer_periph, uint32_t ccuctl);
/* configure TIMER ocref_clr source */
void timer_ocpre_clr_source_select(uint32_t timer_periph, uint32_t ocrsel);
/* configure TIMER ocref_clr selection */
void timer_ocpre_clr_int_source_select(uint32_t timer_periph, uint32_t selection);

/* TIMER DMA and event */
/* enable the TIMER DMA */
void timer_dma_enable(uint32_t timer_periph, uint32_t dma);
/* disable the TIMER DMA */
void timer_dma_disable(uint32_t timer_periph, uint32_t dma);
/* channel DMA request source selection */
void timer_channel_dma_request_source_select(uint32_t timer_periph, uint32_t dma_request);
/* configure the TIMER DMA transfer */
void timer_dma_transfer_config(uint32_t timer_periph, uint32_t dma_baseaddr, uint32_t dma_lenth);
/* software generate events */
void timer_event_software_generate(uint32_t timer_periph, uint32_t event);

/* TIMER channel complementary protection */
/* initialize TIMER break parameter struct */
void timer_break_struct_para_init(timer_break_parameter_struct *breakpara);
/* configure TIMER break function */
void timer_break_config(uint32_t timer_periph, timer_break_parameter_struct *breakpara);
/* enable TIMER break function */
void timer_break_enable(uint32_t timer_periph);
/* disable TIMER break function */
void timer_break_disable(uint32_t timer_periph);
/* enable TIMER output automatic function */
void timer_automatic_output_enable(uint32_t timer_periph);
/* disable TIMER output automatic function */
void timer_automatic_output_disable(uint32_t timer_periph);
/* enable or disable TIMER primary output function */
void timer_primary_output_config(uint32_t timer_periph, ControlStatus newvalue);
/* break external input enable */
void timer_break_external_input_enable(uint32_t timer_periph);
/* break cmp enable */
void timer_break_cmp_enable(uint32_t timer_periph, uint32_t break_cmp);
/* break external input disable */
void timer_break_external_input_disable(uint32_t timer_periph);
/* break cmp disable */
void timer_break_cmp_disable(uint32_t timer_periph, uint32_t break_cmp);
/* configure TIMER break external input polarity */
void timer_break_external_input_polarity_config(uint32_t timer_periph, uint32_t polarity);
/* configure TIMER break cmp polarity */
void timer_break_cmp_polarity_config(uint32_t timer_periph, uint32_t break_cmp, uint32_t polarity);
/* break auto recover event selection */
void timer_break_auto_recover_event_select(uint32_t timer_periph, uint32_t event);

/* TIMER channel output */
/* initialize TIMER channel output parameter struct */
void timer_channel_output_struct_para_init(timer_oc_parameter_struct *ocpara);
/* configure TIMER channel output function */
void timer_channel_output_config(uint32_t timer_periph, uint16_t channel, timer_oc_parameter_struct *ocpara);
/* configure TIMER channel output compare mode */
void timer_channel_output_mode_config(uint32_t timer_periph, uint16_t channel, uint32_t ocmode);
/* configure TIMER channel output pulse value */
void timer_channel_output_pulse_value_config(uint32_t timer_periph, uint16_t channel, uint32_t pulse);
/* configure TIMER channel output shadow function */
void timer_channel_output_shadow_config(uint32_t timer_periph, uint16_t channel, uint16_t ocshadow);
/* configure TIMER channel output fast function */
void timer_channel_output_compare_fast_config(uint32_t timer_periph, uint16_t channel, uint16_t ocfast);
/* configure TIMER channel output clear function */
void timer_channel_output_clear_config(uint32_t timer_periph, uint16_t channel, uint16_t occlear);
/* configure TIMER channel output polarity */
void timer_channel_output_polarity_config(uint32_t timer_periph, uint16_t channel, uint16_t ocpolarity);
/* configure TIMER channel complementary output polarity */
void timer_channel_complementary_output_polarity_config(uint32_t timer_periph, uint16_t channel, uint16_t ocnpolarity);
/* configure TIMER channel enable state */
void timer_channel_output_state_config(uint32_t timer_periph, uint16_t channel, uint32_t state);
/* configure TIMER channel complementary output enable state */
void timer_channel_complementary_output_state_config(uint32_t timer_periph, uint16_t channel, uint16_t ocnstate);
/* initialize TIMER multi mode channel output parameter struct */
void timer_multi_mode_channel_output_parameter_struct_init(timer_omc_parameter_struct *omcpara);
/* configure TIMER multi mode channel output function */
void timer_multi_mode_channel_output_config(uint32_t timer_periph, uint16_t channel, timer_omc_parameter_struct *omcpara);
/* select multi mode channel mode */
void timer_multi_mode_channel_mode_config(uint32_t timer_periph, uint32_t channel, uint32_t multi_mode_sel);
/* configure TIMER write CHxVAL register selection */
void timer_write_chxval_register_config(uint32_t timer_periph, uint16_t ccsel);
/* configure TIMER output value selection */
void timer_output_value_selection_config(uint32_t timer_periph, uint16_t outsel);
/* configure TIMER output match pulse selection */
void timer_output_match_pulse_select(uint32_t timer_periph, uint32_t channel, uint16_t pulsesel);
/* configure the TIMER composite PWM mode output pulse value*/
void timer_channel_composite_pwm_pulse_config(uint32_t timer_periph, uint32_t channel, uint32_t pulse, uint32_t add_pulse);
/* configure the TIMER asymmetric PWM mode output pulse value*/
void timer_channel_asymmetric_pwm_pulse_config(uint32_t timer_periph, uint32_t channel, uint32_t pulse, uint32_t add_pulse);
/* configure TIMER channel additional compare value */
void timer_channel_additional_compare_value_config(uint32_t timer_periph, uint16_t channel, uint32_t value);
/* read TIMER channel additional compare value */
uint16_t timer_channel_additional_compare_value_read(uint32_t timer_periph, uint16_t channel);
/* configure TIMER channel additional output shadow function */
void timer_channel_additional_output_shadow_config(uint32_t timer_periph, uint16_t channel, uint16_t aocshadow);
/* configure TIMER channel period point match moment OxCPRE level in the composite PWM or asymmetric PWM mode */
void timer_channel_composite_asymmetric_pwm_level_config(uint32_t timer_periph, uint16_t channel, ControlStatus newvalue);

/* TIMER channel input */
/* initialize TIMER channel input parameter struct */
void timer_channel_input_struct_para_init(timer_ic_parameter_struct *icpara);
/* configure TIMER input capture parameter */
void timer_input_capture_config(uint32_t timer_periph, uint16_t channel, timer_ic_parameter_struct *icpara);
/* configure TIMER channel input capture prescaler value */
void timer_channel_input_capture_prescaler_config(uint32_t timer_periph, uint16_t channel, uint16_t prescaler);
/* read TIMER channel capture compare register value */
uint32_t timer_channel_capture_value_register_read(uint32_t timer_periph, uint16_t channel);
/* configure TIMER input pwm capture function */
void timer_input_pwm_capture_config(uint32_t timer_periph, uint16_t channel, timer_ic_parameter_struct *icpwm);
/* configure TIMER hall sensor mode */
void timer_hall_mode_config(uint32_t timer_periph, uint32_t hallmode);


